---
kind: method
id: M:Autodesk.Revit.DB.Events.DocumentWorksharingEnabledEventArgs.GetDocument
source: html/ec85ce1b-7767-0d6f-3ce5-c29a19468a7a.htm
---
# Autodesk.Revit.DB.Events.DocumentWorksharingEnabledEventArgs.GetDocument Method

Returns document associated with this event

## Syntax (C#)
```csharp
public Document GetDocument()
```

## Returns
The document associated with this event.